tutorials/incompressible/pisoFoam/les/motorBike/motorBike/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    front
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          160;
        startFace       3456;
    }
    back
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          160;
        startFace       3616;
    }
    inlet
    {
        type            patch;
        nFaces          64;
        startFace       3776;
    }
    outlet
    {
        type            patch;
        nFaces          64;
        startFace       3840;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          160;
        startFace       3904;
    }
    upperWall
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          160;
        startFace       4064;
    }
)

// ************************************************************************* //
